import React from 'react';
import {
    Svg,
    Circle,
    Ellipse,
    G,
    LinearGradient,
    RadialGradient,
    Line,
    Path,
    Polygon,
    Polyline,
    Rect,
    Symbol,
    Text,
    Use,
    Defs,
    Stop,
    TSpan
} from 'react-native-svg';

export default function DefaultCarImage(props) {
    return (
        <Svg height="233" width="414" viewBox="0 0 414 233">
            <G id="Group_6046" transform="translate(0 -88)" data-name="Group 6046">
                <G id="nophoto" transform="translate(937 -1168)">
                    <Rect height="233" id="Rectangle_2388" width="414" fill="#f8f8f8" transform="translate(-937 1256)"
                          data-name="Rectangle 2388"/>
                </G>
                <G id="Group_6043" opacity="0.604" transform="translate(91.916 112)" data-name="Group 6043">
                    <Path id="Path_4604"
                          d="M901.359,716.1a162.461,162.461,0,0,0-5.519-21.511q-.571-1.51-1.194-2.963c-6.775-15.8-13.263-20.7-16.579-27.408s-15.567-28.385-18.306-32.16a22.312,22.312,0,0,0-6.186-6.258,17.736,17.736,0,0,0-5.9-2.152c-6.371-1.041-21.186-2.785-48.984-2.787h-3.353c-29.916,0-44.147,1.79-50.293,3.011a14.9,14.9,0,0,0-4.429,1.815,22.459,22.459,0,0,0-6.343,6.37c-2.739,3.775-14.993,25.448-18.308,32.16s-9.8,11.608-16.576,27.408q-.624,1.451-1.2,2.963a162.758,162.758,0,0,0-5.516,21.511,181,181,0,0,0-2.078,31.973c.319,15.815,1.505,26.9,3.034,31.234a2.443,2.443,0,0,0,.857,1.157c2.683.981,6.237,2.228,10.04,3.42v13.884a9.03,9.03,0,0,0,9.137,8.862h17.814a9.029,9.029,0,0,0,9.137-8.862v-8.943c1.164.021,1.847.021,1.847.021h109.1s.7,0,1.889-.021v8.943a9.028,9.028,0,0,0,9.137,8.862h17.812a9.028,9.028,0,0,0,9.137-8.862v-13.9c3.526-1.1,6.844-2.231,9.432-3.193a2.908,2.908,0,0,0,1.415-1.346c1.533-4.313,2.723-15.413,3.043-31.258A181.257,181.257,0,0,0,901.359,716.1ZM740.883,651.884c7.214-15.524,11.878-17.93,15.974-18.74,4.376-.864,76.281-.762,80.366,0,4.1.766,8.758,3.216,15.971,18.74s6.594,17.188,6.594,18.3c0,0-7.357,7.341-62.75,7.341s-62.75-7.341-62.75-7.341C734.288,669.072,733.672,667.41,740.883,651.884Zm-5.163,79.879a17.294,17.294,0,0,1-17.551-17.027c0-9.4,3.226-17.025,12.919-17.025s22.183,7.622,22.183,17.025A17.294,17.294,0,0,1,735.72,731.763Zm96.511,21.019c-.748.085-18.546,2.087-33.984,2.087-15.406,0-35.49-1.995-36.337-2.08a4.468,4.468,0,0,1-4.076-4.863,4.536,4.536,0,0,1,5.013-3.953c.2.021,20.469,2.032,35.4,2.032,14.909,0,32.744-2,32.922-2.025a4.533,4.533,0,0,1,5.068,3.886A4.461,4.461,0,0,1,832.231,752.782Zm26.129-21.019a17.3,17.3,0,0,1-17.553-17.027c0-9.4,12.49-17.025,22.183-17.025s12.921,7.622,12.921,17.025A17.294,17.294,0,0,1,858.36,731.763Z"
                          fill="#dedede" transform="translate(-682.039 -620.862)" data-name="Path 4604"/>
                    <Path id="Path_4605"
                          d="M697.8,662.528c5.435-9.391,10.234-13.9,13.028-19.553.706-1.429,1.773-3.464,3.062-5.851-1.6-.194-9.936-1.118-15.461.037-6.13,1.279-9.707,2.6-10.559,5.41-3.362,11.095,2.226,15.923,9.458,19.774A2.946,2.946,0,0,0,697.8,662.528Z"
                          fill="#dedede" transform="translate(-686.87 -600.272)" data-name="Path 4605"/>
                    <Path id="Path_4606"
                          d="M800.819,642.572c-.852-2.808-4.429-4.131-10.559-5.41-5.579-1.166-14.023-.212-15.5-.032,1.286,2.385,2.353,4.42,3.057,5.847,2.8,5.659,7.6,10.166,13.037,19.569a3.236,3.236,0,0,0,.51-.2C798.6,658.495,804.183,653.666,800.819,642.572Z"
                          fill="#dedede" transform="translate(-571.822 -600.272)" data-name="Path 4606"/>
                </G>
                <G id="Group_6045" transform="translate(-11 17)" data-name="Group 6045">
                    <G id="Group_2164" transform="translate(127.496 140)" data-name="Group 2164">
                        <Text id="No_Image" fontFamily="Helvetica-Light, Helvetica" fontWeight="200" fontSize="41"
                              transform="translate(90.504 39)" data-name="No Image">
                            <TSpan x="-89.995" y="0">No Image</TSpan>
                        </Text>
                    </G>
                    <Text id="マイカー画像を登録しよう_" fontFamily="PingFangSC-Semibold, PingFang SC" fontSize="16"
                          transform="translate(225 208)" data-name="マイカー画像を登録しよう。">
                        <TSpan x="-104" y="0" fontFamily="HiraginoSans-W6, Hiragino Sans" fontWeight='bold'>マイカー画像を登録しよう。</TSpan>
                    </Text>
                </G>
                <G id="Group_6044" transform="translate(0 2)" data-name="Group 6044">
                    <G id="Rectangle_3588" fill="#fff" stroke="#262525" strokeWidth="2" transform="translate(127 244)"
                       data-name="Rectangle 3588">
                        <Rect height="40" width="160" rx="20" stroke="none"/>
                        <Rect height="38" width="158" fill="none" rx="19" x="1" y="1"/>
                    </G>
                    <Text id="登録する" fill="#333" fontFamily="HiraginoSans-W6, Hiragino Sans" fontWeight='bold' fontSize="16"
                          transform="translate(222 270)">
                        <TSpan x="-32" y="0">登録する</TSpan>
                    </Text>
                    <Path id="ic_create_24px"
                          d="M3,17.25V21H6.75L17.81,9.94,14.06,6.19ZM20.71,7.04a1,1,0,0,0,0-1.41L18.37,3.29a1,1,0,0,0-1.41,0L15.13,5.12l3.75,3.75,1.83-1.83Z"
                          fill="#262525" transform="translate(158 252.002)"/>
                </G>
            </G>
        </Svg>
    );
}
